{
  "pageTitle": "Understanding Erectile Dysfunction Causes",
  "theme": "default",
  "introText": "Erectile dysfunction rarely happens without reason. Understanding what causes ED is the first step toward effective treatment. While aging increases risk, ED is not an inevitable part of getting older. Physical conditions, medications, lifestyle factors, and psychological issues all contribute. Identifying your specific causes helps determine the most appropriate treatment approach.",
  "relatedSearchesLabel": "Understanding ED",
  "adUnits": [
    {
      "title": "ED Causes Quiz",
      "url": "https://example.com/ed-causes-quiz",
      "backgroundImage": ""
    },
    {
      "title": "Get ED Evaluation",
      "url": "https://example.com/ed-evaluation",
      "backgroundImage": ""
    },
    {
      "title": "Cardiovascular & ED",
      "url": "https://example.com/cardiovascular-ed",
      "backgroundImage": ""
    },
    {
      "title": "Diabetes and ED",
      "url": "https://example.com/diabetes-ed",
      "backgroundImage": ""
    },
    {
      "title": "Psychological ED Help",
      "url": "https://example.com/psychological-ed",
      "backgroundImage": ""
    }
  ],
  "secondIntroText": "Erectile function requires healthy blood vessels, nerves, hormones, and psychology all working together. Problems in any of these systems can cause ED. Often multiple factors contribute simultaneously. The good news is that identifying and addressing underlying causes, combined with effective ED treatments, resolves the issue for most men.",
  "sections": [
    {
      "title": "Physical Causes of ED",
      "content": "Cardiovascular disease is the most common physical cause - anything affecting blood flow to the heart also affects flow to the penis. Atherosclerosis (hardened arteries) restricts blood needed for erections. High blood pressure and high cholesterol damage blood vessels. Diabetes affects both blood vessels and nerves essential for erectile function. Obesity, metabolic syndrome, and low testosterone all increase ED risk. Neurological conditions, prostate issues, and certain medications can cause or worsen ED."
    },
    {
      "title": "Medical Conditions Linked to ED",
      "listItems": [
        "<strong>Heart Disease</strong>: ED often appears 3-5 years before heart problems, serving as an early warning",
        "<strong>Diabetes</strong>: Over 50% of diabetic men develop ED due to blood vessel and nerve damage",
        "<strong>High Blood Pressure</strong>: Both the condition and some medications used to treat it cause ED",
        "<strong>Low Testosterone</strong>: Reduced sex drive and erectile difficulty in 30% of men over 50",
        "<strong>Kidney Disease</strong>: Affects hormones, circulation, energy, and nervous system function"
      ]
    }
  ],
  "secondAdUnits": [
    {
      "title": "ED Blood Tests",
      "url": "https://example.com/ed-blood-tests",
      "backgroundImage": ""
    },
    {
      "title": "Medication-Induced ED",
      "url": "https://example.com/medication-induced-ed",
      "backgroundImage": ""
    },
    {
      "title": "Performance Anxiety Help",
      "url": "https://example.com/performance-anxiety",
      "backgroundImage": ""
    },
    {
      "title": "ED Risk Assessment",
      "url": "https://example.com/risk-assessment",
      "backgroundImage": ""
    },
    {
      "title": "Schedule ED Consultation",
      "url": "https://example.com/schedule-consultation",
      "backgroundImage": ""
    }
  ],
  "additionalSections": [
    {
      "title": "Psychological Causes of ED",
      "content": "Mental health significantly impacts erectile function. Depression and anxiety disrupt the brain signals necessary for arousal and erections. Stress from work, finances, or relationships interferes with sexual performance. Performance anxiety creates a self-perpetuating cycle where worry about ED causes more ED. Relationship problems reduce intimacy and desire. Past sexual trauma or guilt about sex affects arousal. Even when psychological factors are primary, they often coexist with physical issues."
    },
    {
      "title": "Lifestyle Factors That Cause ED",
      "content": "Smoking damages blood vessels and reduces circulation essential for erections. Heavy alcohol use depresses the nervous system and disrupts hormone production. Drug use, especially opioids, marijuana, and cocaine, impair sexual function. Being overweight or obese increases diabetes, heart disease, and low testosterone risks. Lack of exercise weakens cardiovascular health and testosterone production. Poor sleep disrupts hormone cycles. Chronic stress elevates cortisol which suppresses testosterone."
    },
    {
      "title": "Medications That Cause ED",
      "content": "Many common medications list ED as a side effect. Blood pressure medications (especially older beta-blockers), antidepressants (particularly SSRIs), anti-anxiety drugs, antihistamines, acid reflux medications, and opioid pain medications commonly cause or worsen ED. Never stop prescribed medications without consulting your doctor, but ask if alternatives with fewer sexual side effects exist. Sometimes adjusting dosages or timing helps. ED medications can often overcome medication-induced erectile problems."
    },
    {
      "title": "Get to the Root of Your ED",
      "content": "Understanding why you have ED is crucial for effective treatment. A thorough evaluation examines medical history, current medications, lifestyle factors, and psychological contributors. Blood tests check testosterone, cholesterol, blood sugar, and other markers. This comprehensive assessment identifies specific causes so treatment can address them. Whether ED stems from physical issues, psychological factors, or both, effective solutions exist. Consult with a healthcare provider to uncover the causes of your ED and develop a targeted treatment plan."
    }
  ]
}

